import * as yup from "yup";

export const registerSchema = yup.object({
  name: yup
    .string()
    .required("பயனர் பெயர் காலியாக இருக்கக்கூடாது"),

  email: yup
    .string()
    .email("சரியான மின்னஞ்சல் முகவரியை உள்ளிடவும்")
    .required("மின்னஞ்சல் காலியாக இருக்கக்கூடாது"),

  mobile : yup
    .string()
    .matches(
      /^[6-9]\d{9}$/,
      "சரியான 10 இலக்க கைபேசி எண்ணை உள்ளிடவும்"
    )
    .required("மொபைல் எண் காலியாக இருக்கக்கூடாது"),

  password: yup
    .string()
    .min(6, "கடவுச்சொல் குறைந்தது 6 எழுத்துகள் இருக்க வேண்டும்")
    .matches(
      /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[!@#$%^&*()_+\-=\[\]{};':"\\|,.<>\/?]).{6,}$/,
      "கடவுச்சொல் குறைந்தது 1 பெரிய எழுத்து, 1 சிறிய எழுத்து, 1 எண் மற்றும் 1 சிறப்பு எழுத்து கொண்டிருக்க வேண்டும்,(e.g. A1234@b)"
    )
    .required("கடவுச்சொல் காலியாக இருக்கக்கூடாது"),

  confirmPassword: yup
    .string()
    .oneOf(
      [yup.ref("password")],
      "கடவுச்சொல் மற்றும் உறுதி கடவுச்சொல் பொருந்தவில்லை"
    )
    .required("கடவுச்சொல் உறுதி காலியாக இருக்கக்கூடாது"),

  country: yup
    .string()
    .required("நாட்டை தேர்வு செய்யவும்"),

  state: yup
    .string()
    .required("மாநிலத்தை தேர்வு செய்யவும்"),
});
