import * as Yup from "yup";

export const ResetPasswordValidation = Yup.object().shape({
  newPassword: Yup
  .string()
    .min(6, "கடவுச்சொல் குறைந்தது 6 எழுத்துகள் இருக்க வேண்டும்")
    .matches(
      /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[!@#$%^&*()_+\-=\[\]{};':"\\|,.<>\/?]).{6,}$/,
      "கடவுச்சொல் குறைந்தது 1 பெரிய எழுத்து, 1 சிறிய எழுத்து, 1 எண் மற்றும் 1 சிறப்பு எழுத்து கொண்டிருக்க வேண்டும்,(e.g. A1234@b)"
    )
    .required("கடவுச்சொல் காலியாக இருக்கக்கூடாது"),

  confirmPassword: Yup
  .string()
      .oneOf(
        [Yup.ref("newPassword")],
        "கடவுச்சொல் மற்றும் உறுதி கடவுச்சொல் பொருந்தவில்லை"
      )
      .required("கடவுச்சொல் உறுதி காலியாக இருக்கக்கூடாது"),
  
})
